Repository: mmsd-ts/mmsd-helpers
Catalog: plugins/MmsdHelpers/resources/locales/*/mmsd_helpers.po
Languages: es

source: International phone numbers are not supported
es: No se admiten números de teléfono internacionales

source: The phone number %1$s was changed to %2$s. Please make sure it is correct.
es: El número de teléfono %1$s fue cambiado a %2$s. Por favor, asegúrese de que es correcto.

source: Phone number invalid
es: Número de teléfono no válido

source: Phone number format not recognized
es: No se reconoce el formato del número de teléfono

source: Name was changed
es: El nombre fue cambiado

source: Address Finder
es: Buscador de direcciones

source: It is very important to use accurate addresses.
es: Es muy importante utilizar direcciones precisas.

source: Number
es: Número

source: Direction
es: Dirección

source: Street
es: Nombre de la calle

source: Type
es: Tipo

source: Apt
es: Dpto

source: City
es: Ciudad

source: State
es: Estado

source: Zip code
es: Código postal

source: Find Address
es: Busque una dirección

source: We are unable to find that address. Use it anyway?
es: No podemos encontrar esa dirección. ¿Usarlo de todos modos?

source: Use my address as entered
es: Usar mi dirección tal y como fue introducida

source: That is not a valid address
es: Esa no es una dirección válida

source: Close
es: Cierre

source: Required field
es: Campo requerido
